
/*
* Copyright (c) 2025. Username
*/
/*
* Це спеціальний коментар для документування (Doc comment).
* За допомогою спеціальної утиліти, такі коментарі можна перетворити на HTML-сторінки,
* які разом створюють документацію до вашої програми.
* Для зручності тут можна використовувати спеціальні посилання {@link Main} та <i>HTMLтеги</i>
*/
class Program
{
    /*
    * Цей метод є "точкою входу" програми. У проекті може бути лише один метод із такою
   сигнатурою
    * під час запуску програми
    */
    static void Main(string[] args)
    {
        // Це однорядковий коментар (single line comment)
        /*
        * Це коментар у вигляді блоку (block comment)
        */
        // TODO: це спеціальний TODO-коментар. Тут можна описати, що потрібно ще доробити
        // FIXME: це теж TODO-коментар, зазвичай тут дрібні баги і що потрібно ще виправити
        // TODO:2023-09-01:Username: дописати виведення даних у файл
        int my_variable = 5; // Коментарі після виразів повинні бути вирівняні
        int my_other_variable = 999; // за допомогою табуляції
        int number = 924;
        // Якщо потрібно закоментувати код, то рядок коментується однорядковим коментарем
        // int my_old_variable = 100;
        // int my_other_old_variable = 200;
        // Перед коментарем прийнято залишати порожній рядок
        int spd = 25; // ПОГАНО: Не рекомендується, назва не інформативна
        int carminspd = 25; // ПОГАНО: Не заощаджуйте на назвах змінних!
        int carMinSpeed = 25; // ДОБРЕ: Назва змінної говорить сама за себе
        int s = 0; // МОЖНА: однолітерні допускаються, тільки якщо це
                   // короткоживучі змінні
        int speed = 150; // ДОБРЕ: зрозуміло, що змінна відповідає за швидкість
        int Speed = 150; // ПОГАНО: змінні не повинні починатися з капса
        int SPEED = 150; // ПОГАНО: вкрай не рекомендується
                         // Якщо назва змінної складається із двох слів
        int max_speed = 150; // Можна: використовувати знак _ для відділення слів
        int maxSpeed = 150; // ДОБРЕ: нормально, використовується стиль lowerCamelCase
        int MaxSpeed = 150; // ПОГАНО: Не рекомендується, змінні не повинні починатися
                            // з капса
        int моя_переменная = 356; // ПОГАНО: Теоретично можна, але дуже погано
        int ǄǅǲȯȺώϷЂ = 145; // ПОГАНО: Так можна, але, треба вбивати за таке
        int viyskova_chast = 29; // ПОГАНО: Трансліт з кирилиці - це моветон!
        int _myvar = 100; // ПОГАНО: Теоретично можна, але НЕ рекомендується
        /*
        int $myvar = 100; // НЕ МОЖНА: заборонено починати з спец. символів
        int 2pac = 0; // НЕ МОЖНА: з цифри починати не можна
        int % d = 5; // НЕ МОЖНА: з інших знаків починати не можна
        int 'f' = 5; // НЕ МОЖНА: з лапок починати не можна
        */
        const int Min_Speed = 25; // ДОБРЕ: константи починаються з великої літери
        const int MIN_SPEED = 25; // МОЖНА: стиль Java для констант іменування констант
    }
    // Приклади оголошення масивів
    private static void AnnounceArrays()
    {
        /*
        * ДОБРЕ: згідно з усіма угодами за кодом та різними рекомендаціями, квадратні
        * дужки ставлять ПІСЛЯ ТИПУ ДАНИХ
        */
        int[] goodArray;
        // int badArray[]; // НЕ МОЖНА: компілятор видасть помилку
        // int[5] anotherBadArray; // НЕ МОЖНА: при оголошенні не можна вказати його
        // розмірність

        // Оголошення багатовимірних масивів
        int[,] twoDimensionalArray; // МОЖНА: вказано 2 виміру
        int[,,] threeDimensionalArray; // МОЖНА: вказано 3 виміру
                                       // Ініціалізація масивів
        goodArray = new int[10]; // Ініціалізуємо масив із 10 елементами
        goodArray[0] = 15; // Привласнюємо значення першому елементу масиву
        goodArray[1] = 25; // Привласнюємо значення другому елементу масиву
        twoDimensionalArray = new int[5, 4];
        // twoDimensionalArray = new int[5][4]; // НЕ МОЖНА: помилка компіляції
        twoDimensionalArray[0, 0] = 1; // Привласнюємо значення
        twoDimensionalArray[1, 5] = 5; // НЕ МОЖНА: Компілятор видасть помилку
                                       // Оголошення масиву з ініціалізацією
        int[,] array2D = new int[,] { { 1, 2 }, { 3, 4 }, { 5, 6 } }; // МОЖНА
                                                                      // Ініціалізація масиву після оголошення
        int[,] array5;
        array5 = new int[,] { { 1, 2 }, { 3, 4 }, { 5, 6 }, { 7, 8 } }; // МОЖНА
        Console.WriteLine(twoDimensionalArray[1, 6]); // ПОГАНО: Компілятор не видасть
                                                      // помилку
    }
    // Приклади застосування циклів
    private void DesignLoops()
    {
        int progression = 0;
        // Так офорілюється for
        for (int i = 0; i < 5; i++)
        {
            progression += i;
        }
        // ПОГАНО: так оформляти цикли не рекомендується
        for (int i = 0; i < 5; i++) progression += i;
        // ПОГАНО: так оформляти цикли не рекомендується
        for (int i = 0; i < 5; i++)
            progression += i;
        // Порожній for
        for (int j = 0; j < 10; j++) ;
        // Так оформляється while
        int iterator = 0;
        while (iterator < 10)
        {
            // робимо щось у циклі
            iterator++;
        }
        // Так оформляється do-while
        int loops = 10;
        do
        {
            // щось робимо
            loops--;
        } while (loops > 0);
        // Так оформляється foreach
        var fibNumbers = new List<int> { 0, 1, 1, 2, 3, 5, 8, 13 };
        foreach (int element in fibNumbers)
        {
            Console.Write($"{element} ");
        }
    }
    // Приклади застосування умовних конструкцій
    private void ifStatements()
    {
        int a = 5;
        int b = 4;
        int min;
        // Так потрібно оформляти звичайний if
        if (a >= b)
        {
            min = b;
        }
        // Так потрібно оформляти if-else
        if (a >= b)
        {
            min = b;
        }
        else
        {
            min = a;
        }
        // Так потрібно оформляти звичайний if-else if-else
        if (a > b)
        {
            min = b;
        }
        else if (a < b)
        {
            min = a;
        }
        else
        {
            min = a;
        }
        // У C# використовується тернарний оператор ?
        min = (a >= b) ? b : a;
        // Це рівнозначно наступному виразу
        if (a >= b)
        {
            min = b;
        }
        else
        {
            min = a;
        }
        // Так оформляється switch
        switch (a)
        {
            case 1:
                // щось робимо
                break;
            case 2:
                // щось робимо
                break;
            default:
                // це виконується в тому випадку, якщо жоден з кейсів не здійснився
                break;
        }
    }
    /* Приклади оформлення функцій (методів)
    * Синтаксис функції:
    * [1-модифікатори доступу] [2-тип значення, що повертається] [3-ім'я]([4-аргументи])
    * [5-список винятків] { 6 - тіло функції }
    * 1 – модифікатори доступу: на даний можна нічого не писати або писати private
    * 2 - тип значення, що повертається або void, якщо функція нічого не повертає
    * 3 - обмеження як і на імена змінних, але є додаткові правила найменування
    * 4 - список аргументів через кому, наприклад (int a, double b)
    * Якщо немає аргументів - порожні дужки
    * 5 – виняток поки не розглядаємо, якщо їх немає, то просто нічого не пишуть
    * 6 - тіло функції, у ньому відбувається виконання функції.
    * Якщо є тип даних, що повертається - повинен бути return
    */
    private int FindMinimum(int a, int b)
    {
        int min;
        min = (a < b) ? a : b;
        return min;
    }
    /*
    * Назва методу починається з великої літери, якщо кілька слів - використовується
    * lowerCamelCase.
    * Перше слово має бути дієсловом (т.к. метод, як правило, "щось робить"), інші слова
    * можуть бути прикметниками, іменниками тощо. Символ _ бажано не використовувати
    */
    // ДОБРЕ: з маленької літери, перше слово - дієслово
    private void DrawCircle() { }
    // ПОГАНО: Символи $ і _ не використовуємо
    // private void $er() { }
    // ПОГАНО: Символи _ не використовуємо
    private void Draw_circle() { }
    // ПОГАНО: перше слово з маленької літери
    private void draw() { }
    // ПОГАНО: перше слово має бути дієсловом
    private void circle() { }
}